In [1]:
import pymysql
import pandas as pd

host = '127.0.0.1'
port = "3306"
user = 'root'
password = ''
database = 'hooman'

conn = pymysql.connect(
    host=host,
    port=int(port),
    user=user,
    passwd=password,
    db=database,
    charset='utf8mb4')

def run(sql):
    df = pd.read_sql_query(sql,conn)
    return df

In [2]:
run("select * from persons")

   id     name
0   1  nurhadi
1   2     aldo
2   3     dodi

In [3]:
run("select * from hobbies")

   id  person_id              name
0   1          1     Bird watching
1   2          1      Martial arts
2   3          2            Hiking
3   4          1           Archery
4   5          2        Beekeeping
5   6          3  Book restoration

In [4]:
run("""
select person_id, p.name as name, GROUP_CONCAT(h.name ORDER BY h.name ASC SEPARATOR ', ') as hobbies
from persons p
inner join hobbies h on p.id = h.person_id
group by p.id, p.name
""")

   person_id     name                               hobbies
0          1  nurhadi  Archery, Bird watching, Martial arts
1          2     aldo                    Beekeeping, Hiking
2          3     dodi                      Book restoration